Revit 2027 API
Space.DesignOtherLoadperArea Property
Get or set the Design Other Load per Area of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DesignOtherLoadperArea { get; set; }
Public Property DesignOtherLoadperArea As Double
	Get
	Set
public:
property double DesignOtherLoadperArea {
	double get ();
	void set (double value);
}
member DesignOtherLoadperArea : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Design Other Load per Area (Unit: W/ft2) of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace